const MACHINE_DB = [
  {
    "name": "わざマシン001 きあいパンチ",
    "effect": "",
    "location": "『シルフカンパニー』に落ちている"
  },
  {
    "name": "わざマシン002 ドラゴンクロー",
    "effect": "",
    "location": "『チャンピオンロード』に落ちている"
  },
  {
    "name": "わざマシン003 みずのはどう",
    "effect": "",
    "location": "『ハナダシティ』でジムリーダーのカスミに勝利後にもらう"
  },
  {
    "name": "わざマシン004 めいそう",
    "effect": "",
    "location": "『ヤマブキシティ』でジムリーダーのナツメに勝利後にもらう"
  },
  {
    "name": "わざマシン005 ほえる",
    "effect": "",
    "location": "『4ばんどうろ』に落ちている\n『タマムシシティ』の『タマムシデパート』2階で購入(1000円)"
  },
  {
    "name": "わざマシン006 どくどく",
    "effect": "",
    "location": "『セキチクシティ』でジムリーダーのキョウに勝利後にもらう"
  },
  {
    "name": "わざマシン007 あられ",
    "effect": "",
    "location": "『チャンピオンロード』に落ちている"
  },
  {
    "name": "わざマシン008 ビルドアップ",
    "effect": "",
    "location": "『シルフカンパニー』に落ちている"
  },
  {
    "name": "タネマシンガン",
    "effect": "",
    "location": "『オツキミやま』に落ちている"
  },
  {
    "name": "わざマシン010 めざめるパワー",
    "effect": "",
    "location": "特性『ものひろい』で入手(5%)"
  },
  {
    "name": "わざマシン011 にほんばれ",
    "effect": "",
    "location": "『サファリゾーン』に落ちている"
  },
  {
    "name": "わざマシン012 ちょうはつ",
    "effect": "",
    "location": "『ロケットだんアジト』に落ちている"
  },
  {
    "name": "わざマシン013 れいとうビーム",
    "effect": "",
    "location": "『タマムシシティ』の『ロケットゲームコーナー』の景品(4000枚)"
  },
  {
    "name": "わざマシン014 ふぶき",
    "effect": "",
    "location": "『ポケモンやしき』に落ちている"
  },
  {
    "name": "わざマシン015 はかいこうせん",
    "effect": "",
    "location": "『タマムシシティ』の『タマムシデパート』2階で購入(7500円)"
  },
  {
    "name": "わざマシン016 ひかりのかべ",
    "effect": "",
    "location": "『タマムシシティ』の『タマムシデパート』屋上で『おいしいみず』と交換"
  },
  {
    "name": "わざマシン017 まもる",
    "effect": "",
    "location": "『むじんはつでんしょ』に落ちている"
  },
  {
    "name": "わざマシン018 あまごい",
    "effect": "",
    "location": "『15ばんどうろ』に落ちている"
  },
  {
    "name": "わざマシン019 ギガドレイン",
    "effect": "",
    "location": "『タマムシシティ』でジムリーダーのエリカに勝利後にもらう"
  },
  {
    "name": "わざマシン020 しんぴのまもり",
    "effect": "",
    "location": "『タマムシシティ』の『タマムシデパート』屋上で『サイコソーダ』と交換"
  },
  {
    "name": "わざマシン021 やつあたり",
    "effect": "",
    "location": "『ロケットだんアジト』に落ちている"
  },
  {
    "name": "わざマシン022 ソーラービーム",
    "effect": "",
    "location": "『ポケモンやしき』に落ちている"
  },
  {
    "name": "わざマシン023 アイアンテール",
    "effect": "",
    "location": "『タマムシシティ』の『ロケットゲームコーナー』の景品(3500枚)"
  },
  {
    "name": "わざマシン024 10まんボルト",
    "effect": "",
    "location": "『タマムシシティ』の『ロケットゲームコーナー』の景品(4000枚)"
  },
  {
    "name": "わざマシン025 かみなり",
    "effect": "",
    "location": "『むじんはつでんしょ』に落ちている"
  },
  {
    "name": "わざマシン026 じしん",
    "effect": "",
    "location": "『トキワシティ』でジムリーダーのサカキに勝利後にもらう"
  },
  {
    "name": "わざマシン027 おんがえし",
    "effect": "",
    "location": "『12ばんどうろ』で女の子からもらう"
  },
  {
    "name": "わざマシン028 あなをほる",
    "effect": "",
    "location": "『ハナダシティ』でロケット団員に勝利後にもらえる\n『タマムシシティ』の『タマムシデパート』2階で購入(2000円)"
  },
  {
    "name": "わざマシン029 サイコキネシス",
    "effect": "",
    "location": "『ヤマブキシティ』でエスパーおやじからもらう"
  },
  {
    "name": "わざマシン030 シャドーボール",
    "effect": "",
    "location": "『タマムシシティ』の『ロケットゲームコーナー』の景品(4500枚)"
  },
  {
    "name": "わざマシン031 かわらわり",
    "effect": "",
    "location": "『サント・アンヌごう』に落ちている\n『タマムシシティ』の『タマムシデパート』2階で購入(3000円)"
  },
  {
    "name": "わざマシン032 かげぶんしん",
    "effect": "",
    "location": "『サファリゾーン』に落ちている"
  },
  {
    "name": "わざマシン033 リフレクター",
    "effect": "",
    "location": "『タマムシシティ』の『タマムシデパート』屋上で『ミックスオレ』と交換"
  },
  {
    "name": "わざマシン034 でんげきは",
    "effect": "",
    "location": "『クチバシティ』でジムリーダーのマチスに勝利後にもらう"
  },
  {
    "name": "わざマシン035 かえんほうしゃ",
    "effect": "",
    "location": "『タマムシシティ』の『ロケットゲームコーナー』の景品(4000枚)"
  },
  {
    "name": "わざマシン036 ヘドロばくだん",
    "effect": "",
    "location": "『ロケットだんそうこ』に落ちている"
  },
  {
    "name": "わざマシン037 すなあらし",
    "effect": "",
    "location": "『チャンピオンロード』に落ちている"
  },
  {
    "name": "わざマシン038 だいもんじ",
    "effect": "",
    "location": "『グレンじま』でジムリーダーのカツラに勝利後にもらう"
  },
  {
    "name": "わざマシン039 がんせきふうじ",
    "effect": "",
    "location": "『ニビシティ』でジムリーダーのタケシに勝利後にもらう"
  },
  {
    "name": "わざマシン040 つばめがえし",
    "effect": "",
    "location": "『9ばんどうろ』に落ちている"
  },
  {
    "name": "わざマシン041 いちゃもん",
    "effect": "",
    "location": "『シルフカンパニー』に落ちている"
  },
  {
    "name": "わざマシン042 からげんき",
    "effect": "",
    "location": "『おもいでのとう』で『ミックスオレ』を供えると男性からもらえる"
  },
  {
    "name": "わざマシン043 ひみつのちから",
    "effect": "",
    "location": "『25ばんどうろ』に落ちている\n『タマムシシティ』の『タマムシデパート』2階で購入(3000円)"
  },
  {
    "name": "わざマシン044 ねむる",
    "effect": "",
    "location": "『サント・アンヌごう』に落ちている"
  },
  {
    "name": "わざマシン045 メロメロ",
    "effect": "",
    "location": "『24ばんどうろ』に落ちている\n『タマムシシティ』の『タマムシデパート』2階で購入(3000円)"
  },
  {
    "name": "わざマシン046 どろぼう",
    "effect": "",
    "location": "『オツキミやま』に落ちている"
  },
  {
    "name": "わざマシン047 はがねのつばさ",
    "effect": "",
    "location": "『サファリゾーン』に落ちている"
  },
  {
    "name": "わざマシン048 スキルスワップ",
    "effect": "",
    "location": "『12ばんどうろ』に落ちている"
  },
  {
    "name": "わざマシン049 よこどり",
    "effect": "",
    "location": "『ロケットだんアジト』に落ちている"
  },
  {
    "name": "わざマシン050 オーバーヒート",
    "effect": "",
    "location": "『チャンピオンロード』に落ちている"
  },
  {
    "name": "わざマシン001 いあいぎり",
    "effect": "",
    "location": "『サント・アンヌごう』で船長からもらう"
  },
  {
    "name": "わざマシン002 そらをとぶ",
    "effect": "",
    "location": "『16ばんどうろ』で女の子からもらう"
  },
  {
    "name": "わざマシン003 なみのり",
    "effect": "",
    "location": "『サファリゾーン』で係員からもらう"
  },
  {
    "name": "わざマシン004 かいりき",
    "effect": "",
    "location": "『セキチクシティ』で『きんのいれば』を届けると園長からもらえる"
  },
  {
    "name": "わざマシン005 フラッシュ",
    "effect": "",
    "location": "『2ばんどうろ』でポケモンを10種類以上捕まえていると助手からもらえる"
  },
  {
    "name": "わざマシン006 いわくだき",
    "effect": "",
    "location": "『ともしびおんせん』でおじいさんからもらう"
  },
  {
    "name": "わざマシン007 たきのぼり",
    "effect": "",
    "location": "『いてだきのどうくつ』に落ちている"
  },
  {
    "name": "わざマシン008 ダイビング",
    "effect": "",
    "location": "ルビー・サファイア・エメラルド限定。ファイアレッド・リーフグリーンでは入手できない"
  }
];\n